// Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

string digitTwo = Console.ReadLine();
Console.WriteLine("Второе число из 3-значного числа: " + digitTwo[1]);